Repository: MrZhuNi/salome_geom
Catalog: src/GEOMContext/GEOM_msg_*.po
Languages: fr

# GEOM_BUT_APPLY
source: &Apply
fr: &Appliquer

# GEOM_BUT_CLOSE
source: &Close
fr: &Fermer

# GEOM_BUT_CANCEL
source: &Cancel
fr: &Annuler

# GEOM_BUT_YES
source: &Yes
fr: &Oui

# GEOM_BUT_NO
source: &No
fr: &Non

# GEOM_BUT_HELP
source: &Help
fr: &Aide

# GEOM_BUT_EXPLODE
source: &Explode
fr: &Exploser

# GEOM_INF_LOADED
source: File %1 loaded.
fr: Le fichier %1 est chargé.

# GEOM_PRP_COMMAND
source: No command associated with this id = %1.
fr: Pas de commande associée à l'id = %1.

# GEOM_PRP_ABORT
source: Operation aborted
fr: L'opération a echoué

# GEOM_PRP_DONE
source: Operation done
fr: Opération effectuée

# GEOM_PRP_LOADING
source: Loading %1 ...
fr: Chargement de %1 ...

# GEOM_PRP_NULLSHAPE
source: Error, null or inappropriate shape !
fr: Erreur, objet inconsistant ou inapproprié !

# GEOM_PRP_READY
source: Ready
fr: Prêt...

# GEOM_PRP_SELECT_SUBSHAPES
source: Select Sub Shapes
fr: Selection de sous objets

# GEOM_CONFIRM
source: Confirm operation
fr: Confirmer cette operation

# GEOM_CONFIRM_INFO
source: Shape contains %1 sub shapes !
fr: L'objet contient %1 sous objets

# GEOM_PRP_NOT_FOR_VTK_VIEWER
source: Not allowed in VTK viewer
fr: Non permis dans viewer VTK

# GEOM_PRP_SHAPE_IN_STUDY
source: Main shape must be in the study before
fr: La shape principale doit etre avant dans l'etude

# GEOM_PRP_SELECT_EDGE
source: Select edges and click on Apply
fr: Selectionner les edges et clicker sur Apply

# GEOM_PRP_SELECT_FACE
source: Select faces to suppress and click on Ok/Apply
fr: Select les faces a supprimer et clicker sur Ok/Apply

# GEOM_PRP_SELECT_FIRST
source: Select main shape first
fr: Selectionner la shape principale en premier

# GEOM_PRP_MIN_DIST
source: Min Distance not computed
fr: Min Distance non calculer

# GEOM_MEN_ALL_FILES
source: All Files ( * )
fr: Tous fichiers ( * )

# GEOM_MEN_COMPONENT
source: Geometry
fr: Géometrie

# GEOM_MEN_ENTER_ANGLE
source: Enter An Angle In Degrees
fr: Saisir un angle en degrés

# GEOM_MEN_EXPORT
source: Export
fr: Exporter

# GEOM_MEN_IMPORT
source: Import
fr: Importer

# GEOM_MEN_IMPORT_BREP
source: BREP Files ( *.brep )
fr: Fichiers BREP ( *.brep )

# GEOM_MEN_IMPORT_IGES
source: IGES Files ( *.iges *.igs )
fr: Fichiers IGES ( *.iges *.igs )

# GEOM_MEN_IMPORT_STEP
source: STEP Files ( *.step *.stp )
fr: Fichiers STEP ( *.step *.stp )

# GEOM_MEN_LOAD_SCRIPT
source: PYTHON Files ( *.py )
fr: Fichiers PYTHON ( *.py )

# GEOM_MEN_ISOS
source: Select Number Of Isos
fr: Choisir un nombre d'isos

# GEOM_MEN_POPUP_NAME
source: %1 Objects
fr: %1 Objets

# GEOM_MEN_SKETCHER_X
source: Enter a length to set X
fr: Saisir une longueur pour fixer X

# GEOM_MEN_SKETCHER_Y
source: Enter a length to set Y
fr: Saisir une longueur pour fixer Y

# GEOM_MEN_TRANSPARENCY
source: Transparency
fr: Transparence

# GEOM_MEN_TRANSPARENCY_LABEL
source: Transparency :
fr: Transparence :

# GEOM_MEN_STEP_LABEL
source: Step :
fr: Increment

# GEOM_IDENTICAL_NAMES_SELECT_BY_MOUSE
source: Identical names : select by mouse !
fr: Noms identiques : selectionner avec la souris !

# GEOM_NAME_INCORRECT
source: Object name not found
fr: Le nom saisi n'existe pas

# GEOM_WRN_RADIUS_NULL
source: Radius is null
fr: Le rayon est nul

# GEOM_WRN_WARNING
source: Warning
fr: Avertissement

# GEOM_REALLY_DELETE
source: Do you really want to delete object(s) ?
fr: Voulez-vous supprimer l'object(s) ?

# GEOM_OBJECT
source: Object
fr: Objet

# GEOM_MAIN_OBJECT
source: Main Object
fr: Objet Principal

# GEOM_TOOL_OBJECT
source: Tool Object
fr: Objet Outil

# GEOM_BASE_OBJECT
source: Base Object
fr: Objet De Base

# GEOM_PATH_OBJECT
source: Path Object
fr: Objet Chemin

# GEOM_OBJECTS
source: Objects
fr: Objets

# GEOM_OBJECT_I
source: Object %1
fr: Objet %1

# GEOM_OBJECT_RESULT
source: Object And Result
fr: Objet Et Résultat

# GEOM_BASE_POINT
source: Base Point
fr: Point De Base

# GEOM_CENTER_POINT
source: Center Point
fr: Point Centre

# GEOM_DIAGONAL_POINTS
source: Diagonal Points
fr: Points Diagonaux

# GEOM_CENTRAL_POINT
source: Central Point
fr: Point Central

# GEOM_CENTER
source: Center
fr: Centre

# GEOM_RADIUS
source: Radius :
fr: Rayon

# GEOM_RADIUS_I
source: Radius %1 :
fr: Rayon %1

# GEOM_HEIGHT
source: Height :
fr: Hauteur

# GEOM_LENGTH
source: Length is :
fr: Longueur :

# GEOM_WEIGHT
source: Weight :
fr: poids

# GEOM_COORDINATES
source: Coordinates
fr: Coordonnées

# GEOM_REVERSE
source: Reverse
fr: Renverser

# GEOM_REVERSE_U
source: Reverse U
fr: Renverser U

# GEOM_REVERSE_V
source: Reverse V
fr: Reverser V

# GEOM_AXIS
source: Axis
fr: Axe

# GEOM_MATRIX
source: Matrix :
fr: Matrice :

# GEOM_VECTOR_LENGTH
source: Vector Length :
fr: Longueur Du Vecteur :

# GEOM_REVERSE_VECTOR
source: Reverse Vector
fr: Renverser Le Vecteur

# GEOM_PLANE_MIRROR
source: Plane Mirror
fr: Plan Miroir

# GEOM_FACE_SELECTION
source: Face Selection
fr: Selection de Face

# GEOM_WATER_DENSITY
source: Water Density :
fr: Densité de l'eau :

# GEOM_MESHING_DEFLECTION
source: Meshing Deflect. :
fr: Déflection Du Maillage :

# GEOM_PRECISION
source: Precision :
fr: Précision :

# GEOM_SELECTION
source: Selection
fr: Sélection

# GEOM_NB_TIMES
source: Nb. Times :
fr: Nb. Fois :

# GEOM_NB_TIMES_U
source: Nb. Times U :
fr: Nb. Fois U :

# GEOM_NB_TIMES_V
source: Nb. Times V :
fr: Nb. Fois V :

# GEOM_STEP
source: Step :
fr: Pas :

# GEOM_STEP_V
source: Step V :
fr: Pas V :

# GEOM_STEP_U
source: Step U :
fr: Pas U :

# GEOM_TOLERANCE
source: Tolerance
fr: Tolérance

# GEOM_REVOLUTION
source: Revolution
fr: Révolution

# GEOM_ARCHIMEDE
source: Archimede
fr: Archimède

# GEOM_COMMON
source: Common
fr: Joindre

# GEOM_CUT
source: Cut
fr: Couper

# GEOM_FILLING
source: Filling
fr: Surface Par Courbes

# GEOM_FUSE
source: Fuse
fr: Fusionner

# GEOM_SCALE
source: Scale
fr: Echelle

# GEOM_SEWING
source: Sewing
fr: Coudre

# GEOM_WPLANE
source: Working Plane
fr: Plan de Travail

# GEOM_MIRROR
source: Mirror
fr: Miroir

# GEOM_PRISM
source: Prism
fr: Extrusion

# GEOM_SUB_SHAPE
source: Sub Shapes
fr: Sous Shapes

# GEOM_SUPRESSFACE
source: Supress Face
fr: Supression de Face

# GEOM_FILLET
source: Fillet
fr: Conge

# GEOM_CHAMFER
source: Chamfer
fr: Chanfrein

# GEOM_BNDBOX
source: Bounding Box
fr: Boite Anglobante

# GEOM_CMASS
source: Center Of Mass
fr: Centre de Masse

# GEOM_PROPERTIES
source: Basic Properties
fr: Basiques Proprietes

# GEOM_BOX
source: Box
fr: Boite

# GEOM_CIRCLE
source: Circle
fr: Cercle

# GEOM_ELLIPSE_TITLE
source: Ellipse Construction
fr: Construction d'Ellipses

# GEOM_RADIUS_MAJOR
source: Major radius :
fr: Rayon max. :

# GEOM_RADIUS_MINOR
source: Minor radius :
fr: Rayon min. :

# GEOM_CYLINDER
source: Cylinder
fr: Cylindre

# GEOM_LINE
source: Line
fr: Ligne

# GEOM_PLANE
source: Plane
fr: Plan

# GEOM_SOLID
source: Solid
fr: Solide

# GEOM_SPHERE
source: Sphere
fr: Sphère

# GEOM_SURFCONE
source: Conical Face
fr: Face Conique

# GEOM_SURFCYLINDER
source: Cylindrical Face
fr: Face Cylindrique

# GEOM_SURFSPHERE
source: Spherical Face
fr: Face Sphèrique

# GEOM_SURFTORUS
source: Toroidal Face
fr: Face Toroique

# GEOM_TORUS
source: Torus
fr: Tore

# GEOM_VECTOR
source: Vector
fr: Vecteur

# GEOM_VECTOR_U
source: Vector U
fr: Vecteur U

# GEOM_VECTOR_V
source: Vector V
fr: Vecteur V

# GEOM_PARAMETER
source: Parameter :
fr: Paramètre :

# GEOM_STEP_TITLE
source: Step value for GUI constructions
fr: Increment par défaut lors des constructions

# GEOM_ARC_TITLE
source: Arc Construction
fr: Construction d'un Arc

# GEOM_ARCHIMEDE_TITLE
source: Archimede Construction
fr: Construction d'Archimède

# GEOM_BNDBOX_TITLE
source: Bounding Box Informations
fr: Boite Englobante

# GEOM_BNDBOX_OBJDIM
source: Object And Its Dimensions
fr: Objet and ses dimensions

# GEOM_BOX_TITLE
source: Box Construction
fr: Construction d'une Boite

# GEOM_BOX_OBJ
source: Dimensions At Origin
fr: Dimensions A l'Origine

# GEOM_CHAMFER_TITLE
source: Chamfer Construction
fr: Construction d'un Chanfrein

# GEOM_CHAMFER_ALL
source: Chamfer On Whole Shape
fr: Chanfrein sur toute la Shape

# GEOM_CHAMFER_EDGES
source: Chamfer On Edges From Shape
fr: Chanfrein sur Edges de la Shape

# GEOM_CHAMFER_FACES
source: Chamfer On Faces From Shape
fr: Chanfrein sur Faces de la Shape

# GEOM_CIRCLE_TITLE
source: Circle Construction
fr: Construction d'un Cercle

# GEOM_CMASS_TITLE
source: Center Of Mass Construction
fr: Centre De Gravité

# GEOM_PLANE_SIZE
source: Size of plane :
fr: Taille du plan :

# GEOM_COMMON_TITLE
source: BOOLEAN : Common Of Two Objects
fr: BOOLEEN : Jonction De Deux Objets

# GEOM_COMPOUND_TITLE
source: Create A Compound
fr: Création d'un Compound

# GEOM_CONE_TITLE
source: Cone Construction
fr: Construction d'un Cone

# GEOM_CUT_TITLE
source: BOOLEAN : Cut Of Two Objects
fr: BOOLEEN : Couper Deux Objets

# GEOM_CYLINDER_TITLE
source: Cylinder Construction
fr: Construction d'un Cylindre

# GEOM_CHECK_TITLE
source: Check Shape Informations
fr: Check Shape

# GEOM_CHECK_INFOS
source: Object And Its Topological Informations
fr: Objet et ses Informations Topologiques

# GEOM_MINDIST_TITLE
source: Minimun Distance Between Two Objects
fr: Distance Minimale entre Deux Objets

# GEOM_MINDIST_OBJ
source: Objects And Results
fr: Objets Et Resultats

# GEOM_EDGE_TITLE
source: Create An Edge
fr: Création d'un Edge

# GEOM_FILLET_TITLE
source: Fillet Construction
fr: Construction d'un Congé

# GEOM_FILLET_ALL
source: Fillet On Whole Shape
fr: Congé sur toute la Shape

# GEOM_FILLET_EDGES
source: Fillet On Edges From Shape
fr: Congé sur Edges de la Shape

# GEOM_FILLET_FACES
source: Fillet On Faces From Shape
fr: Congé sur Faces de la Shape

# GEOM_FACE_TITLE
source: Create A Face
fr: Création d'une Face

# GEOM_FACE_FFW
source: Face from a wire
fr: Face a partir d'un wire

# GEOM_FACE_OPT
source: Try to create a planar face
fr: Création d'une Face plane

# GEOM_FILLING_TITLE
source: Filling Surface With Curves
fr: Surface Par Courbes

# GEOM_FILLING_ARG
source: Arguments And Parameters
fr: Argument Et Parametres

# GEOM_FILLING_COMPOUND
source: Curves Comp.
fr: Compound de Courbes

# GEOM_FUSE_TITLE
source: BOOLEAN : Fuse Two Objects
fr: BOOLEEN : Fusionner deux Objets

# GEOM_INERTIA_TITLE
source: Calculs Of Inertia
fr: Calculs d'Inertie

# GEOM_INERTIA_CONSTR
source: Matrix And Moments Of Inertia
fr: Matrice Et Moments d'Inertie

# GEOM_LINE_TITLE
source: Line Construction
fr: Construction d'une Ligne

# GEOM_TOLERANCE_TITLE
source: Maximum Tolerance
fr: Tolerance Maximale

# GEOM_TOLERANCE_CONSTR
source: Object And Its Tolerances
fr: Object et ses Tolerances

# GEOM_MIRROR_TITLE
source: Mirror An Object
fr: Methode Miroir

# GEOM_ORIENTATION_TITLE
source: Change Orientation
fr: Changer l'Orientation

# GEOM_ORIENTATION_OPT
source: Reverse orientation with normal vectors simulation
fr: Renverser l'orientation avec une simulation de vecteur normal

# GEOM_PARTITION_TITLE
source: Partition Of Object With Tool
fr: Partition d'Objects Avec Outils

# GEOM_KEEP_OBJECT
source: Keep Object
fr: Objet garde

# GEOM_PARTITION_ORIENTATION
source: Change Orientation
fr: Change l'orientation

# GEOM_PIPE_TITLE
source: Pipe Construction
fr: Construction d'une Pipe

# GEOM_POINT_TITLE
source: Point Construction
fr: Construction d'un Point

# GEOM_PLANE_TITLE
source: Plane Construction
fr: Construction d'un Plan

# GEOM_PLANE_PVC
source: Point + Coordinate Vector
fr: Point + Vecteur Coordonnes

# GEOM_PLANE_PV
source: Point + Vector
fr: Point + Vecteur

# GEOM_PRISM_TITLE
source: Prism Construction
fr: Extruder une Shape de base

# GEOM_PRISM_BSV
source: Base Shape + Vector
fr: Shape de base + Vecteur

# GEOM_PROPERTIES_TITLE
source: Basic Properties Informations
fr: Proprietes Basiques

# GEOM_PROPERTIES_CONSTR
source: Object And Its Properties
fr: Objet et ses Proprietes

# GEOM_PROPERTIES_SURFACE
source: Surface is :
fr: Surface :

# GEOM_PROPERTIES_VOLUME
source: Volume is :
fr: Volume :

# GEOM_REVOLUTION_TITLE
source: Construction By Revolution
fr: Construction Par Revolution

# GEOM_ROTATION_TITLE
source: Rotation Of An Object
fr: Rotation d'un Objet

# GEOM_SCALE_TITLE
source: Scale An Object
fr: Echelle d'un Objet

# GEOM_SCALE_FACTOR
source: Scale Factor :
fr: Facteur d'echelle

# GEOM_SECTION_TITLE
source: BOOLEAN : Section Of Two Objects
fr: BOOLEEN : Section De Deux Objets

# GEOM_SEWING_TITLE
source: Sewing Topologies
fr: Coudre des Topologies

# GEOM_SHELL_TITLE
source: Shell Construction
fr: Construction d'une Shell

# GEOM_SOLID_TITLE
source: Solid Construction
fr: Construction d'un Solid

# GEOM_SPHERE_TITLE
source: Sphere Construction
fr: Construction d'une Sphere

# GEOM_SPHERE_CR
source: Center + Radius
fr: Centre + rayon

# GEOM_SPHERE_RO
source: Radius At Origin
fr: Rayon a l'origine

# GEOM_SUBSHAPE_TITLE
source: Sub Shapes Selection
fr: Selection de Sous Shapes

# GEOM_SUBSHAPE_TYPE
source: Sub Shapes Type :
fr: Type de Sous Shapes

# GEOM_SUBSHAPE_SELECT
source: Select Sub Shapes
fr: Selectionner de Sous Shapes

# GEOM_TORUS_TITLE
source: Torus Construction
fr: Constructiond'un Tore

# GEOM_SUPRESSFACE_TITLE
source: Suppress Faces In An Object
fr: Supprimer des Faces dans un Objet

# GEOM_SUPRESSFACE_SELECT
source: Select Faces To Suppress
fr: Selectionner les Faces a Supprimer

# GEOM_TRANSLATION_COOR
source: Translation With Coordinates
fr: Translation Avec Coordonnees

# GEOM_TRANSPARENCY_TITLE
source: Transparency
fr: Transparence

# GEOM_SUPPRESSHOLE_TITLE
source: Suppress holes
fr: Suppression de trous

# GEOM_SUPPRESSHOLE_SELECTFACE
source: Select the face with hole
fr: Selection de la face initiale

# GEOM_SUPPRESSHOLE_SELECTWIRE
source: Select wire on face
fr: Selection du contour/trou sur la face

# GEOM_SUPPRESSHOLE_SELECTFACE_END
source: Select end face (if hole traversing)
fr: Selection de la face terminale (si trou traversant)

# GEOM_SUPPRESSHOLE_SELECTWIRE_END
source: Select end wire (if hole traversing)
fr: Selection de contour final (si trou traversant)

# GEOM_SUPPRESSHOLE_FACE_SHELL
source: Face or shell
fr: Face ou shell

# GEOM_SUPPRESSHOLE_SELECT_HOLES_ON_FACE
source: Select hole(s) on the face
fr: Selection de trou(s) sur la face

# GEOM_TRANSLATION_TITLE
source: Translation Of An Object
fr: Translation d'un Objet

# GEOM_VECTOR_TITLE
source: Vector Construction
fr: Construction d'un Vecteur

# GEOM_WHATIS_TITLE
source: Whatis Informations
fr: Whatis

# GEOM_WHATIS_OBJECT
source: Object And Its Topological Informations
fr: Objet et ses Informations Topologiques

# GEOM_WIRE_TITLE
source: Create A Wire
fr: Creer un Wire

# GEOM_WIRE_CONNECT
source: Wire creation from wires/edges connected
fr: Creation d'un Wire a partir de wires/edges connectes

# GEOM_WPLANE_TITLE
source: Working Plane Selection
fr: plan de travail

# GEOM_WPLANE_FACE
source: Plane Or Planar Face
fr: Plan Ou Face plane

# GEOM_PARAM_POINT
source: Parametric point
fr: Point paramétrique

# GEOM_MEN_WIREFRAME
source: Wireframe
fr: Filaire

# GEOM_MEN_SHADING
source: Shading
fr: Ombré

# GEOM_RECONSTRUCTION_LIMIT
source: Reconstruction Limit
fr: Limite de Reconstruction

# GEOM_SUPPRESS_RESULT
source: Suppress Result
fr: Supprimer le Resultat

# GEOM_SUPPRESS_RESULT_INSIDE
source: Inside
fr: Intérieur

# GEOM_SUPPRESS_RESULT_OUTSIDE
source: Outside
fr: Extérieur

# GEOM_SPLINE_TITLE
source: Spline Construction
fr: Construction de Splines

# GEOM_SKETCHER_EL
source: Element Type
fr: Type d'Element

# GEOM_BUT_CLOSE_SKETCH
source: Close Sketcher
fr: Fermer Sketch

# GEOM_BUT_END_SKETCH
source: End Sketcher
fr: Terminer Sketch

# GEOM_SKETCHER_TITLE
source: Spline Construction
fr: Construction de Sketch

# GEOM_SKETCHER_SEGMENT
source: Segment
fr: Sègment

# GEOM_SKETCHER_ABS
source: Absolute
fr: Absolu

# GEOM_SKETCHER_SEL
source: Selection
fr: Sélection

# GEOM_SKETCHER_PER
source: Perpendicular
fr: Perpendiculaire

# GEOM_SKETCHER_LENGTH
source: Length
fr: Longueur

# GEOM_SKETCHER_LENGTH2
source: Length :
fr: Longueur :

# GEOM_SKETCHER_APPLY
source: Apply
fr: Appliquer

# GEOM_SKETCHER_VALUES
source: Values
fr: Valeurs
